In [134]:
import pandas as pd 
import numpy as np

 ### eksik_veri_durumu

In [135]:
hava_durumu ={"istanbul":[30,29,np.nan],"ankara":[20,np.nan,25]
              ,"izmir":[40,39,38] 
              ,"adana":[np.nan,np.nan,50]}
hava_durumu_dataFrame=pd.DataFrame(hava_durumu
                                   ,["pz","pzt","sl"])

## onemliNot : data frame datasi dict olarak verilirse
#  keyWords hemen colomun labeli olur

In [136]:
hava_durumu_dataFrame

     istanbul  ankara  izmir  adana
pz       30.0    20.0     40    NaN
pzt      29.0     NaN     39    NaN
sl        NaN    25.0     38   50.0

In [137]:
hava_durumu_dataFrame.dropna()
#nan bulundugu yerleri siliyor

Empty DataFrame
Columns: [istanbul, ankara, izmir, adana]
Index: []

In [138]:
#eger sutunlar uzerine yapmak istesek
hava_durumu_dataFrame.dropna(axis =1,thresh=2)
#tresh kac tane nan oldugu zaman sileyim
#  ;yani sinir (sart) ve uzeri siliyor

     istanbul  ankara  izmir
pz       30.0    20.0     40
pzt      29.0     NaN     39
sl        NaN    25.0     38

In [139]:
hava_durumu_dataFrame

     istanbul  ankara  izmir  adana
pz       30.0    20.0     40    NaN
pzt      29.0     NaN     39    NaN
sl        NaN    25.0     38   50.0

In [140]:
hava_durumu_dataFrame.dropna()

Empty DataFrame
Columns: [istanbul, ankara, izmir, adana]
Index: []

In [141]:
hava_durumu_dataFrame.fillna(10)
#nan oldugu yerler doldurmak icin

     istanbul  ankara  izmir  adana
pz       30.0    20.0     40   10.0
pzt      29.0    10.0     39   10.0
sl       10.0    25.0     38   50.0

### groupby

In [142]:
verim={"departman":
       ["yazilim","hukuk","yazilim","finans","finans"
        ,"yazilim","hukuk"],
        
        "calisan":
        ["ahmet","mehmet","udey","atil","ubey"
         ,"zeynep","cuvan"],

         "maas":
         [190,555,555,399,599,709,499]}

In [143]:
veri_dataFrame=pd.DataFrame(verim)

In [144]:
veri_dataFrame

  departman calisan  maas
0   yazilim   ahmet   190
1     hukuk  mehmet   555
2   yazilim    udey   555
3    finans    atil   399
4    finans    ubey   599
5   yazilim  zeynep   709
6     hukuk   cuvan   499

In [145]:
grub=veri_dataFrame.groupby("departman")

In [146]:
grub.count()

           calisan  maas
departman
finans           2     2
hukuk            2     2
yazilim          3     3

In [147]:
grub.min()
## her departmanda end dusuk deger getiriyo

          calisan  maas
departman
finans       atil   399
hukuk       cuvan   499
yazilim     ahmet   190

In [148]:
print(grub.max())

          calisan  maas
departman
finans       ubey   599
hukuk      mehmet   555
yazilim    zeynep   709

In [149]:
grub.describe()## tum detay lari getirir

           maas
          count        mean         std    min    25%    50%    75%    max
departman
finans      2.0  499.000000  141.421356  399.0  449.0  499.0  549.0  599.0
hukuk       2.0  527.000000   39.597980  499.0  513.0  527.0  541.0  555.0
yazilim     3.0  484.666667  266.552684  190.0  372.5  555.0  632.0  709.0

###  Concate

In [150]:
verim1={"departman":["yazilim","hukuk","yazilim"]
        ,"calisan":["ahmet","mehmet","udey"]
        ,"maas":[190,270,555]}

In [151]:
verim2 ={"departman":["finans","finans","yazilim","hukuk"]
         ,"calisan":["atil","ubey","zeynep","cuvan"]
         ,"maas":[399,599,555,499]}

In [152]:
verim1_dataFrame=pd.DataFrame(verim1,[0,1,2])

In [153]:
verim2_dataFrame=pd.DataFrame(verim2,[3,4,5,6])

In [154]:
verim1_dataFrame

  departman calisan  maas
0   yazilim   ahmet   190
1     hukuk  mehmet   270
2   yazilim    udey   555

In [155]:
verim2_dataFrame

  departman calisan  maas
3    finans    atil   399
4    finans    ubey   599
5   yazilim  zeynep   555
6     hukuk   cuvan   499

In [156]:
grub3=pd.concat([verim1_dataFrame,verim2_dataFrame])

In [157]:
grub3

  departman calisan  maas
0   yazilim   ahmet   190
1     hukuk  mehmet   270
2   yazilim    udey   555
3    finans    atil   399
4    finans    ubey   599
5   yazilim  zeynep   555
6     hukuk   cuvan   499

In [158]:
grub3.loc[6]

departman    hukuk
calisan      cuvan
maas           499
Name: 6, dtype: object

In [159]:
grub3["departman"]

0    yazilim
1      hukuk
2    yazilim
3     finans
4     finans
5    yazilim
6      hukuk
Name: departman, dtype: object

In [160]:
grub3.loc[6]["maas"]

499

In [161]:
grub3.set_index("calisan")

        departman  maas
calisan
ahmet     yazilim   190
mehmet      hukuk   270
udey      yazilim   555
atil       finans   399
ubey       finans   599
zeynep    yazilim   555
cuvan       hukuk   499

In [162]:
grub3.value_counts()

departman  calisan  maas
finans     atil     399     1
           ubey     599     1
hukuk      cuvan    499     1
           mehmet   270     1
yazilim    ahmet    190     1
           udey     555     1
           zeynep   555     1
dtype: int64

In [163]:
grub3.index.names("label")

TypeError: 'FrozenList' object is not callable

### Merge :
birlestirme  islemi ve bu birlestirme islemi esnasinda ortak bir nokta (column ) seciyoruz ve bu ortak column uzerinden  islemlerimizi yapiyoruz  iki yada daha fazla data frame tek'e donusturmek amacli relational database dusun burada tek column dedigimiz primary key  gibi

In [172]:
# eger birden fazla dataFrame varsa ve bu
# dataFrameler arasinda Ortak bir sutun varsa kullanilir
sozluk1={"name": ["fadi","buji","nur","ubey"],
         "spor":["fb","t","bb","golf"]}

In [173]:
sozluk2={"name": ["fadi","buji","nur","ubey"],
         "kalori":[100,200,300,400]}

In [174]:
sdf1=pd.DataFrame(sozluk1)

In [175]:
sdf2=pd.DataFrame(sozluk2)

In [176]:
sdf1

   name  spor
0  fadi    fb
1  buji     t
2   nur    bb
3  ubey  golf

In [177]:
sdf2

   name  kalori
0  fadi     100
1  buji     200
2   nur     300
3  ubey     400

In [180]:
mercmesi=pd.merge(sdf1,sdf2,on="name")
mercmesi

   name  spor  kalori
0  fadi    fb     100
1  buji     t     200
2   nur    bb     300
3  ubey  golf     400

### _Pandas Ä°leri Operasyonlar

### Excell ile calisma